
let cht = []
let necht=[]
cht[0] =[[['08:00', 'чет', 'История России', 'лек', '300', '2'], ['09:40', 'чет', 'Физика', 'пр', 'лекционный зал №3', '2'], ['11:20', 'чет', 'История России', 'пр', '313', '2'], ['13:30', ' ', 'Основы российской государственности', 'пр', '509', '2']],[['11:20', 'чет', 'Основы программирования', 'лек', '403', '7'], ['13:30', 'чет', 'Информатика и основы информационных технологий', 'лек', '419', '7']], [['09:40', 'чет', 'Линейная алгебра и аналитическая геометрия', 'пр', '329', '7'], ['11:20', '/чет', 'Основы программирования', 'л.р.', '343', '7'], ['11:20', 'чет/неч', 'Информатика и основы информационных технологий', 'л.р.', '426', '7'], ['13:30', '/чет', 'Основы программирования', 'л.р.', '343', '7'], ['13:30', 'чет/неч', 'Информатика и основы информационных технологий', 'л.р.', '426', '7']], [['08:00', ' ', 'Математический анализ', 'пр', '441', '2'], ['09:40', 'чет', 'Физика', 'л.р.', '303', '2'], ['09:40', 'чет', 'Физика', 'л.р.', '303а', '2']], [['09:40', ' ', 'Иностранный язык', 'пр', 'ДОТ', 'ДОТ'], ['09:40', ' ', 'Иностранный язык', 'пр', 'ДОТ', 'ДОТ'], ['11:20', 'чет', 'Иностранный язык', 'пр', 'ДОТ', 'ДОТ'], ['11:20', 'чет', 'Иностранный язык', 'пр', 'ДОТ', 'ДОТ'], ['15:10', 'чет', 'Философия', 'лек', '513', '2'], ['16:50', 'чет', 'Физика', 'лек', 'лекционный зал №1', '2']], [['08:00', ' ', 'Физическая культура и спорт (элективная)', 'пр', 'КСК КАИ ОЛИМП', 'КСК'], ['09:40', 'чет', 'Математический анализ', 'лек', '334', '8']],[]];
necht[0] =[[['08:00', 'неч', 'История России', 'лек', '333', '8'], ['09:40', 'неч', 'Философия', 'пр', '170', '8'], ['11:20', 'неч', 'Математический анализ', 'пр', '407', '8'], ['13:30', ' ', 'Основы российской государственности', 'пр', '509', '2']], [['08:00', 'неч', 'Физическая культура и спорт (элективная)', 'пр', 'КСК КАИ ОЛИМП', 'КСК'], ['09:40', 'неч', 'Философия', 'лек', '170', '8'], ['11:20', 'неч', 'История России', 'лек', '333', '8'], ['13:30', 'неч', 'Основы российской государственности', 'лек', '170', '8']], [['08:00', 'неч', 'Введение в профессиональную деятельность ', 'лек', '327', '7'], ['09:40', 'неч', 'Линейная алгебра и аналитическая геометрия', 'лек', '327', '7'], ['11:20', 'неч/', 'Основы программирования', 'л.р.', '347', '7'], ['11:20', 'чет/неч', 'Информатика и основы информационных технологий', 'л.р.', '426', '7'], ['13:30', 'неч/', 'Основы программирования', 'л.р.', '347', '7'], ['13:30', 'чет/неч', 'Информатика и основы информационных технологий', 'л.р.', '426', '7']], [['08:00', ' ', 'Математический анализ', 'пр', '441', '2'], ['09:40', 'неч', 'Линейная алгебра и аналитическая геометрия', 'пр', '401', '2']], [['09:40', ' ', 'Иностранный язык', 'пр', 'ДОТ', 'ДОТ'], ['09:40', ' ', 'Иностранный язык', 'пр', 'ДОТ', 'ДОТ']], [['08:00', ' ', 'Физическая культура и спорт (элективная)', 'пр', 'КСК КАИ ОЛИМП', 'КСК'], ['09:40', 'неч', 'Математический анализ', 'лек', '505', '8'], ['20:00', 'неч', 'Физическая культура и спорт', 'лек', 'ДОТ', 'ДОТ']],[]];
const ras = document.getElementById('ras')
var year = new Date().getFullYear();
var month = new Date().getMonth();
var today = new Date(year, month, 0).getTime();
var now = new Date().getTime();
var week = Math.round((now - today) / (1000 * 60 * 60 * 24 * 7));
let f={
    'ПН':0,
    'ВТ':1,
    'СР':2,
    'ЧТ':3,
    'ПТ':4,
    'СБ':5,
    'ВС':6,
    'пр':'Практическая работа',
    'л.р.':'Лабораторная работа',
    'лек':'Лекция',
}
     
const renderRas=(array)=>{
    
    const rasHTML = array.map((pred)=>{
        return `
        <li>
            <div class="one-pred">
                <p class="place"><span class="bild">${pred[5]} здание</span> - ${pred[4]} аудитория</p>
                <p class="predName">${pred[2]}</p>
                <p>${f[pred[3]]}</p>
                <p class='time'>${pred[0]}</p>
            </div>
        </li>`
    }).join('')
    ras.innerHTML=rasHTML;
    
}
let date = new Date().getDay()


weekText = document.getElementById('week')
weekDayInfoText = document.getElementById('week_day_info')
console.log(week)

if (week%2==0){
    weekText.innerText = 'Четная неделя'
}else{
    weekText.innerText='Нечетная неделя'
}
const viewDay=(a)=>{
    if (week % 2==0) {
        renderRas(cht[0][f[a]]);
    } else {
        renderRas(necht[0][f[a]]);
    }
    weekDayInfoText.innerText = a.toLowerCase();


   
}
let g={
    '0':'ВС',
    '1':'ПН',
    '2':"ВТ",
    '3':'СР',
    '4':'ЧТ',
    '5':'ПТ',
    '6':'СБ',
}
viewDay(g[`${date}`]);  
